<a href="https://colab.research.google.com/github/afileni/47BDT/blob/main/Pandas_Series_Dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [4]:
## Séries (se assemelha a vetores)
notas = pd.Series([2,7,5,10,6])
notas
notas.values
notas.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
notas = pd.Series([2,7,5,10,6], index=[["Wilfred", "Abbie", "Harry", "Julia", "Carrie"]
])
notas['Julia']
notas.mean()
notas.std()

2.9154759474226504

In [10]:
np.log(notas)

Wilfred    0.693147
Abbie      1.945910
Harry      1.609438
Julia      2.302585
Carrie     1.791759
dtype: float64

In [18]:
##Dataframe é uma estrutura bidimensional de dados
df = pd.DataFrame({'Aluno':["Wilfred", "Abbie", "Harry", "Julia", "Carrie"], 'Faltas':[3,4,5,1,3], 'Prova': [2,8,7,2,5],'Seminario':[8.5,7.5,4.3,5.4,5.7]})
df.dtypes
df.describe() ## estatística básica com analise preliminar dos dados

        Faltas     Prova  Seminario
count  5.00000  5.000000   5.000000
mean   3.20000  4.800000   6.280000
std    1.48324  2.774887   1.691745
min    1.00000  2.000000   4.300000
25%    3.00000  2.000000   5.400000
50%    3.00000  5.000000   5.700000
75%    4.00000  7.000000   7.500000
max    5.00000  8.000000   8.500000

In [23]:
df.sort_values(by='Seminario')
df[(df['Seminario']>6.28) & (df['Prova']>3)]

   Aluno  Faltas  Prova  Seminario
1  Abbie       4      8        7.5

In [30]:
df=pd.read_csv('dados_v3.csv')
df.dtypes
df.describe()

        condominio      quartos  ...         preco          pm2
count  1997.000000  1997.000000  ...  1.997000e+03   1997.00000
mean    971.087631     2.128693  ...  1.229410e+06  13256.74635
std     653.893691     0.793866  ...  1.155809e+06   6977.37614
min       1.000000     1.000000  ...  1.300000e+05   2600.00000
25%     550.000000     1.000000  ...  5.600000e+05   7894.74000
50%     800.000000     2.000000  ...  9.000000e+05  11904.76000
75%    1200.000000     3.000000  ...  1.550000e+06  17156.86000
max    7071.000000     3.000000  ...  1.360000e+07  76666.67000

[8 rows x 7 columns]

In [32]:
df.head()
df.tail()

      condominio  quartos  suites  vagas  area     bairro    preco      pm2
1992        1080        3     1.0    1.0    80  Alphavile   680000  8500.00
1993         750        3     0.0    1.0    82  Alphavile   650000  7926.83
1994         700        3     1.0    1.0   100  Alphavile   629900  6299.00
1995        1850        3     1.0    2.0   166  Alphavile  1600000  9638.55
1996         800        3     1.0    1.0   107  Alphavile   540000  5046.73

In [36]:
df['bairro'].unique()
df['bairro'].value_counts(normalize=True)

Itaim            0.173260
Alphavile        0.170756
Campo Belo       0.153731
Jardins          0.140711
Jardim Europa    0.140210
Tatuapé          0.118678
Moema            0.102654
Name: bairro, dtype: float64

In [39]:
df.groupby('bairro').mean()
df.groupby('bairro').mean()['area']
df.groupby('bairro').mean()['area'].sort_values()

bairro
Tatuapé           79.949367
Alphavile         81.457478
Campo Belo        83.837134
Moema             88.497561
Jardim Europa     91.832143
Jardins          100.615658
Itaim            101.855491
Name: area, dtype: float64

In [40]:
def truncar(bairro):
  return bairro[:4]
## aplico uma função a uma determinada coluna do dataframe 
df['bairro'].apply(truncar)

0       Camp
1       Camp
2       Camp
3       Camp
4       Camp
        ...
1992    Alph
1993    Alph
1994    Alph
1995    Alph
1996    Alph
Name: bairro, Length: 1997, dtype: object

In [ ]:
## usando função lambda (no codigo e anonima)
##As funções lambda são sempre opcionais, tudo que fazemos com ela, podemos fazer também com uma função normal.
## O uso de expressões lambda permite que você possa representar a lógica de uma função sem precisar defini-la explicitamente. 
##Isso pode deixar o código mais facil, mais claro e mais rápido de ser lido
df['bairro'].apply(lambda x: x[:4])

In [49]:
df2 = df.head()
## substituir um valor por nulo 
df2=df2.replace({'pm2': {12031.25: np.nan}})
## excluir registro com null
df2.dropna()

   condominio  quartos  suites  vagas  area      bairro   preco       pm2
0         350        1     0.0    1.0    21  Campo Belo  340000  16190.48
2         674        1     0.0    1.0    61  Campo Belo  600000   9836.07
3         700        1     1.0    1.0    70  Campo Belo  700000  10000.00
4         440        1     0.0    1.0    44  Campo Belo  515000  11704.55

In [51]:
df2.fillna(9500) ## substitui o null por este valor mas em todas as colunas
df2['pm2'].fillna(9500) ##agora substitui apenas na columa pm2
df2['pm2'].fillna(df['pm2'].mean(), inplace=True) ## inplace substitui no dataframe
df2

   condominio  quartos  suites  vagas  area      bairro   preco          pm2
0         350        1     0.0    1.0    21  Campo Belo  340000  16190.48000
1         800        1     0.0    1.0    64  Campo Belo  770000  13256.74635
2         674        1     0.0    1.0    61  Campo Belo  600000   9836.07000
3         700        1     1.0    1.0    70  Campo Belo  700000  10000.00000
4         440        1     0.0    1.0    44  Campo Belo  515000  11704.55000